import numpy as np
a = np.array([(1,2,3),(4,5,6),(7,8,9)])


print(a)
print('**************')
# print(a[:,0])  #读取一列
# print('**************')
# print(a[0])    #读取一行

# print(a[:,-1])  #读取最后一列
# print('**************')
# print(a[:,-2:-1])  #这只是读取倒数一列,并不是读取
# print('**************')
# print(a[-1])    #读取最后一行
# print('**************')
# print(a[-2:-1])    #读取最后一行，这是需要注意的地方
#
#
# print(a[:,0:2])  #读取前两列
# print(a[0:2])    #读取前两行
#
# print(a[:,-2:])  #读取后两列
# print('**************')
# print(a[-2:])    #读取后两行